#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
data.google_client_config.provider: Reading...
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
module.prod_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-prod]
module.stg_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-stg]
module.stg_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-stg/app-front]
module.stg_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-stg/auth-microservice]
module.prod_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-prod/auth-microservice]
module.prod_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-prod/app-front]
module.stg_apps.kubernetes_service.front: Refreshing state... [id=greenmile-stg/front]
module.prod_apps.kubernetes_service.front: Refreshing state... [id=greenmile-prod/front]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.prod_apps.kubernetes_deployment.app_front will be updated in-place
  ~ resource "kubernetes_deployment" "app_front" {
        id               = "greenmile-prod/app-front"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "app-front"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "app-front"
                        # (9 unchanged attributes hidden)



                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (2 unchanged blocks hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.prod_apps.kubernetes_deployment.auth_microservice will be updated in-place
  ~ resource "kubernetes_deployment" "auth_microservice" {
        id               = "greenmile-prod/auth-microservice"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "auth-microservice"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "auth-microservice"
                        # (9 unchanged attributes hidden)



                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (2 unchanged blocks hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "auth_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-autoscaler"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "auth-microservice"
            }
        }
    }

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "front_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + name             = "front-autoscaler"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "app-front"
            }
        }
    }

  # module.prod_apps.kubernetes_ingress.app_ingress will be created
  + resource "kubernetes_ingress" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class" = "gce"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + name             = "app-ingress"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "front"
                          + service_port = "http"
                        }
                    }
                }
            }
        }
    }

  # module.prod_apps.kubernetes_service.auth will be created
  + resource "kubernetes_service" "auth" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "prod"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.prod_apps.kubernetes_service.front will be updated in-place
  ~ resource "kubernetes_service" "front" {
        id                     = "greenmile-prod/front"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                ) -> null
            }
            name             = "front"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
          ~ type                        = "LoadBalancer" -> "ClusterIP"
            # (10 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.stg_apps.kubernetes_deployment.app_front will be updated in-place
  ~ resource "kubernetes_deployment" "app_front" {
        id               = "greenmile-stg/app-front"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "app-front"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "app-front"
                        # (9 unchanged attributes hidden)



                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (2 unchanged blocks hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.stg_apps.kubernetes_deployment.auth_microservice will be updated in-place
  ~ resource "kubernetes_deployment" "auth_microservice" {
        id               = "greenmile-stg/auth-microservice"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "auth-microservice"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "auth-microservice"
                        # (9 unchanged attributes hidden)



                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (2 unchanged blocks hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler.auth_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "auth_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-autoscaler"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 5
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "auth-microservice"
            }
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler" "front_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "stg"
              + "side" = "frontend"
            }
          + name             = "front-autoscaler"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 5
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "app-front"
            }
        }
    }

  # module.stg_apps.kubernetes_ingress.app_ingress will be created
  + resource "kubernetes_ingress" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "kubernetes.io/ingress.class" = "gce"
            }
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "stg"
              + "side" = "frontend"
            }
          + name             = "app-ingress"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "front"
                          + service_port = "http"
                        }
                    }
                }
            }
        }
    }

  # module.stg_apps.kubernetes_service.auth will be created
  + resource "kubernetes_service" "auth" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "stg"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.stg_apps.kubernetes_service.front will be updated in-place
  ~ resource "kubernetes_service" "front" {
        id                     = "greenmile-stg/front"
        # (2 unchanged attributes hidden)


      ~ spec {
          ~ type                        = "LoadBalancer" -> "ClusterIP"
            # (10 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 8 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @au2001, Action: `pull_request`*